# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR-l object detection model with P3-P5 outputs. For details see https://docs.ultralytics.com/models/rtdetr

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

# From BiliBili 魔鬼面具
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2  320×320×64
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4  160×160×128
  - [-1, 1, C2f_RCB, [128]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8  80×80×256  
  - [-1, 1, C2f_RCB, [256]]
  - [-1, 1, Conv, [384, 3, 2]]  # 5-P4/16   40×40×384
  - [-1, 1, C2f_RCB, [384]]
  - [-1, 1, Conv, [384, 3, 2]]  # 7-P5/32     20×20×384
  - [-1, 3, C2f_RCB, [384]]

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 9 input_proj.2
  - [-1, 1, AIFI, [1024, 8]] # 10
  - [-1, 1, Conv, [256, 1, 1]]  # 11, Y5, lateral_convs.0  20×20×256 

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 12  40×40×256
  - [6, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 13 input_proj.1
  - [[-2, -1], 1, Concat, [1]] # 14  40×40×512
  - [-1, 1, DGCST2, [256]]   # 15, fpn_blocks.0 40×40×256
  - [-1, 1, Conv, [128, 1, 1]]   # 16, Y4, lateral_convs.1  40×40×128

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 17  80×80×128
  - [2, 1, SPDConv, [256]] # 18, input_proj.0  160×160×128→80×80×256
  - [[-1, -2, 4], 1, Concat, [1]] # 19  80×80×640
  - [-1, 1, CSPOmniKernel, []] # 20  80×80×256 
  # - [-1, 3, RepC3, [256, 0.5]] # 21
  # - [-1, 1, DGCST, [256]]  # 21  0.223
  # - [-1, 3, DBBC3, [256, 0.5]]
  # - [-1, 3, Conv3XCC3, [256, 0.5]]
  - [-1, 1, DGCST2, [256]]   # 21  0.225 
  # - [-1, 3, DRBC3, [256, 0.5]]
  # - [-1, 3, gConvC3, [256, 0.5]]  
  # - [-1, 3, IELC3, [256, 0.5]] 
  # - [-1, 3, KANC3, [256, 'KAGNConv2DLayer', 0.5]]

  - [-1, 1, Conv, [256, 3, 2]] # 22   40×40×256
  - [[-1, 16], 1, Concat, [1]] # 23  40×40×512
  - [-1, 1, DGCST2, [256]]  # 24   40×40×256 

  - [-1, 1, Conv, [256, 3, 2]] # 25   20×20×256
  - [[-1, 11], 1, Concat, [1]] # 26  20×20×512
  - [-1, 1, DGCST2, [256]]  # 27   20×20×256

  - [[21, 24, 27], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]  # RTDETRDecoder(P3, P4, P5)